Ran Plan for 4 projects:

1. dir: `live/atlantis` workspace: `default`
1. dir: `live/dev/iam` workspace: `default`
1. dir: `live/dev/ec2` workspace: `default`
1. dir: `live/qa/ec2` workspace: `default`

### 1. dir: `live/atlantis` workspace: `default`
**Plan Error**
```
exit status 1: running "terragrunt plan -no-color -out $PLANFILE" in "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis": 
[terragrunt] 2020/01/14 09:51:43 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis] 2020/01/14 09:51:43 Running command: terraform --version
[terragrunt] 2020/01/14 09:51:43 Did not find any Terraform files (*.tf) in /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis
[terragrunt] 2020/01/14 09:51:43 Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `live/dev/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 09:51:43 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam] 2020/01/14 09:51:43 Running command: terraform --version
[terragrunt] 2020/01/14 09:51:43 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/TargetAccountIAM. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 09:51:43 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/TargetAccountIAM into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/.terragrunt-cache/zDPPC18DOE-48-wqXS9Nb8bsd0g/ZfE9b6ZD3Yu4Yt9XdKwzRMWtwl8
[terragrunt] 2020/01/14 09:51:43 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/.terragrunt-cache/zDPPC18DOE-48-wqXS9Nb8bsd0g/ZfE9b6ZD3Yu4Yt9XdKwzRMWtwl8
[terragrunt] 2020/01/14 09:51:43 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/.terragrunt-cache/zDPPC18DOE-48-wqXS9Nb8bsd0g/ZfE9b6ZD3Yu4Yt9XdKwzRMWtwl8
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam] 2020/01/14 09:51:43 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam] 2020/01/14 09:51:43 Running command: terraform init -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true -backend-config=key=iam/terraform.tfstate -backend-config=region=eu-west-1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 09:51:45 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_iam_policy.sourceaccountrolepolicy: Refreshing state... [id=arn:aws:iam::711433298525:policy/SourceAccountRole]
aws_iam_role.sourceaccountrole: Refreshing state... [id=SourceAccountRole]
aws_iam_role_policy_attachment.sourceaccountrolepolicyattach: Refreshing state... [id=SourceAccountRole-20200114084217018800000001]
data.aws_iam_policy_document.cross_account_role_policy: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + description = "Description 1"
      + id          = (known after apply)
      + name        = "policy-1-name"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + description = "Description 2"
      + id          = (known after apply)
      + name        = "policy-2-name"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.sourceaccountrolepolicy will be destroyed
  - resource "aws_iam_policy" "sourceaccountrolepolicy" {
      - arn         = "arn:aws:iam::711433298525:policy/SourceAccountRole" -> null
      - description = "Managed by Terraform" -> null
      - id          = "arn:aws:iam::711433298525:policy/SourceAccountRole" -> null
      - name        = "SourceAccountRole" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_iam_policy_attachment.exclusive_policy_attachment[0] will be created
  + resource "aws_iam_policy_attachment" "exclusive_policy_attachment" {
      + id         = (known after apply)
      + name       = "policy-1-name-policy"
      + policy_arn = (known after apply)
      + roles      = [
          + "the-role-name",
        ]
    }

  # aws_iam_policy_attachment.exclusive_policy_attachment[1] will be created
  + resource "aws_iam_policy_attachment" "exclusive_policy_attachment" {
      + id         = (known after apply)
      + name       = "policy-2-name-policy"
      + policy_arn = (known after apply)
      + roles      = [
          + "the-role-name",
        ]
    }

  # aws_iam_role.cross_account_role will be created
  + resource "aws_iam_role" "cross_account_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::1234567890:role/AWS-Admins"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Managed by Terraform"
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 36000
      + name                  = "the-role-name"
      + path                  = "/engineering/admin/"
      + tags                  = {
          + "Env"   = "dev"
          + "Name"  = "dev-admin-role"
          + "Owner" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.sourceaccountrole will be destroyed
  - resource "aws_iam_role" "sourceaccountrole" {
      - arn                   = "arn:aws:iam::711433298525:role/SourceAccountRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2020-01-14T08:42:15Z" -> null
      - description           = "Managed by Terraform" -> null
      - force_detach_policies = true -> null
      - id                    = "SourceAccountRole" -> null
      - max_session_duration  = 36000 -> null
      - name                  = "SourceAccountRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - unique_id             = "AROA2LJF2UJORZBAX2E53" -> null
    }

  # aws_iam_role_policy_attachment.sourceaccountrolepolicyattach will be destroyed
  - resource "aws_iam_role_policy_attachment" "sourceaccountrolepolicyattach" {
      - id         = "SourceAccountRole-20200114084217018800000001" -> null
      - policy_arn = "arn:aws:iam::711433298525:policy/SourceAccountRole" -> null
      - role       = "SourceAccountRole" -> null
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 54, in resource "aws_iam_policy" "policies":
  54:   count = "${length(var.policies)}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 4 more similar warnings elsewhere)


Warning: Quoted type constraints are deprecated

  on vars.tf line 51, in variable "tags":
  51:   type        = "map"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "map" and write
map(string) instead to explicitly indicate that the map elements are strings.

(and one more similar warning elsewhere)


------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 3. dir: `live/dev/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 09:51:50 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 09:51:50 Running command: terraform --version
[terragrunt] 2020/01/14 09:51:50 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 09:51:50 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 09:51:50 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 09:51:50 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 09:51:50 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 09:51:50 Running command: terraform init -backend-config=encrypt=true -backend-config=key=ec2/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 09:51:52 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0987ee37af7792903"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 4. dir: `live/qa/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 09:51:56 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 09:51:56 Running command: terraform --version
[terragrunt] 2020/01/14 09:51:56 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 09:51:56 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 09:51:56 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 09:51:56 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 09:51:56 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 09:51:56 Running command: terraform init -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true -backend-config=key=ec2/terraform.tfstate -backend-config=region=eu-west-1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 09:51:59 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0987ee37af7792903"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---

